export default `
<h3>2. Краткая история</h3>

<p>Верите или нет, но Node.js всего 10 лет. 

<p>Для сравнения: JavaScript существует на протяжении 24 лет, а веб - 30. 

<p>10 лет - это небольшой срок для технологии, однако порой кажется, что Node.js существовал всегда. 

<p>Я познакомился с Node.js, когда прошло всего 2 года с момента его появления, но уже тогда, несмотря на ограниченность информации, чувствовалось, что его ждет большое будущее. 

<p>В этом разделе мы посмотрим на общую картину истории Node.js. 

<h5>Немного истории</h5>

<p>JavaScript - это язык программирования, изобретенный в Netscape как скриптовый инструмент манипуляции веб-страницами в браузере <a href="https://ru.wikipedia.org/wiki/Netscape_Navigator">Netscape Navigator</a>. 

<p>Частью бизнес-модели Netscape являлась продажа веб-серверов, включающих среду Netscape LiveWire, способную создавать динамические страницы посредством серверного JavaScript. К сожалению, Netscape LiveWire провалился и серверный JavaScript не был популярен до появления Node.js. 

<p>Одним из ключевых факторов популярности Node.js является время его появления. Несколькими годами ранее JavaScript был признан серьезным языком программирования благодаря Web 2.0-приложениям (таким как Flickr, Gmail и др.), показавших миру, как может выглядеть современный веб. 

<p>Движки JavaScript также стали значительно лучше, поскольку браузеры стремились к повышению производительности во благо пользователей. Команды разработчиком главных браузеров упорно трудились над реализацией лучшей поддержки JavaScript и его максимально быстрого выполнения. Движок, который использует Node.js, V8 (также известный как Chrome V8 - открытый движок JavaScript проекта Chromium), вышел победителем из этого соревнования. 

<p>Node.js появился в нужное время и в нужном месте. К счастью, это не единственная причина его популярности. Проект содержал большое количество инновационных идей и подходов к серверной JavaScript-разработке, которые пришлись по вкусу многим разработчикам. 

<h5>2009</h5>

<ul>
    <li>Появился Node.js</li>
    <li>Появился <a href="https://www.npmjs.com/">npm</a></li>
</ul>

<h5>2010</h5>

<ul>
    <li>Express</li>
    <li>Socket.io</li>
</ul>

<h5>2011</h5>

<ul>
    <li>npm версии 1.0</li>
    <li>Крупные компании начали внедрять Node.js: LinkedIn, Uber и др.</li>
    <li>hapi</li>
</ul>

<h5>2012</h5>

<ul>
    <li>Продолжается быстрый рост популярности Node.js</li>
</ul>

<h5>2013</h5>

<ul>
    <li>Первая крупная блог-платформа на Node.js: <a href="https://ghost.org/">Ghost</a></li>
    <li>Koa</li>
</ul>

<h5>2014</h5>

<ul>
    <li>Большой раскол: из Node.js выделился io.js (форк - создание обособленной ветки в системе контроля версий Git) ради поддержки синтаксиса ES6 и более динамичного развития</li>
</ul>

<h5>2015</h5>

<ul>
    <li>Основание <a href="https://openjsf.org/">Node.js Foundation</a></li>
    <li>Io.js вернулся в Node.js (мерж - слияние веток в Git)</li>
    <li>В npm появились частные (приватные) модули</li>
    <li>Node.js версии 4 (версий 1, 2 и 3 не существовало)</li>
</ul>

<h5>2016</h5>

<ul>
    <li>Инцидент с <a href="https://blog.npmjs.org/post/141577284765/kik-left-pad-and-npm">left-pad</a></li>
    <li><a href="https://classic.yarnpkg.com/en/">Yarn</a></li>
    <li>Node.js версии 6</li>
</ul>

<h5>2017</h5>

<ul>
    <li>Повышение безопасности npm</li>
    <li>Node.js 8</li>
    <li>HTTP/2</li>
    <li>V8 включил Node.js в комплект тестирования, официально признав Node.js движком JavaScript в дополнение к Chrome</li>
    <li>3 млрд скачиваний npm каждую неделю</li>
</ul>

<h5>2018</h5>

<ul>
    <li>Node.js 10</li>
    <li>Экспериментальная поддержка <a href="https://nodejs.org/api/esm.html">ES-модулей</a> с расширением .mjs</li>
</ul>
`