export default `
<h3>3. Установка</h3>

<p>Node.js может быть установлен разными способами. 

<p>Дистрибутивы для основных платформ доступны на <a href="https://nodejs.org/en/download/">официальном сайте</a>. 

<p>Очень удобным способом установки Node.js является использование пакетного менеджера. У каждой операционной системы он свой. 

<p>На macOS таковым является <a href="https://brew.sh/">Homebrew</a>, позволяющий легко установить Node.js с помощью командной строки:

<code>
brew install node
</code>

<p>Список пакетных менеджеров для Linux, Windows и др. систем находится <a href="https://nodejs.org/en/download/package-manager/">здесь</a>. 

<p><span>nvm</span> - популярный способ запуска Node.js. Он позволяет легко переключаться между версиями Node.js, устанавливать новые версии для тестирования и отменять их установку в случае, если что-то пошло не так. 

<p>Он также очень полезен при тестировании кода в старых версиях Node.js. 

<p>Для более подробной информации о <span>nvm</span> перейдите по <a href="https://github.com/nvm-sh/nvm">этой ссылке</a>.

<p>Мой совет - используйте официальный установщик, если только начинаете разрабатывать и ранее не пользовались Homebrew. 

<p>После установки Node.js вы получаете доступ к исполняемой программе <span>node</span> в командной строке.
`